hl7_2_ada/ketenzorg/3.0.2/beschikbaarstellen/hl7v3_instance/hl7v3_episodes_bundle_01.xml

<?xml version="1.0" encoding="UTF-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/' xmlns:s='http://www.w3.org/2001/XMLSchema' xmlns:wss='http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.0.xsd' >
    <SOAP-ENV:Body>
        <MCCI_IN200101 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <id extension="114605" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
            <creationTime value="20181127115825"/>
            <versionCode code="NICTIZEd2005-Okt"/>
            <interactionId extension="MCCI_IN200101" root="2.16.840.1.113883.1.6"/>
            <profileId extension="810" root="2.16.840.1.113883.2.4.3.11.1"/>
            <transmissionQuantity value="3"/>
            <acknowledgement typeCode="AA">
                <targetTransmission>
                    <id extension="34745ef4-6429-4142-8efc-99e4714e887e" root="2.16.528.1.1007.3.3.1234567.1"/>
                </targetTransmission>
            </acknowledgement>
            <receiver>
                <device>
                    <id extension="4003" root="2.16.840.1.113883.2.4.6.6"/>
                </device>
            </receiver>
            <sender>
                <device>
                    <id extension="1" root="2.16.840.1.113883.2.4.6.6"/>
                </device>
            </sender>
            <REPC_IN990111NL xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <id extension="114606" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
                <creationTime value="20181127115825"/>
                <versionCode code="NICTIZEd2005-Okt"/>
                <interactionId extension="REPC_IN990111NL" root="2.16.840.1.113883.1.6"/>
                <profileId extension="810" root="2.16.840.1.113883.2.4.3.11.1"/>
                <processingCode code="P"/>
                <processingModeCode code="T"/>
                <acceptAckCode code="NE"/>
                <acknowledgement typeCode="AE">
                    <targetMessage>
                        <id extension="34745ef4-6429-4142-8efc-99e4714e887e" root="2.16.528.1.1007.3.3.1234567.1"/>
                    </targetMessage>
                </acknowledgement>
                <receiver>
                    <device>
                        <id extension="4003" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </receiver>
                <sender>
                    <device>
                        <id extension="1" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </sender>
                <ControlActProcess moodCode="EVN">
                    <effectiveTime value="20181127115825"/>
                    <authorOrPerformer typeCode="AUT">
                        <participant>
                            <AssignedDevice>
                                <id extension="1" root="2.16.840.1.113883.2.4.6.6"/>
                            </AssignedDevice>
                        </participant>
                    </authorOrPerformer>
                    <reasonOf>
                        <justifiedDetectedIssue>
                            <code code="AUTERR_SWV_FALSE" codeSystem="2.16.840.1.113883.2.4.6.6.1.1000" displayName="Er zijn gegevens beschikbaar buiten uw samenwerkingsverband/regio bij zorgaanbieder  (URA: 00003232)"/>
                        </justifiedDetectedIssue>
                    </reasonOf>
                    <queryAck>
                        <queryId extension="KZ_29a3bec1-2009-40c1-b137-060a06aab3db" root="2.16.528.1.1007.3.1.1009.1"/>
                        <queryResponseCode code="AE"/>
                        <resultTotalQuantity value="0"/>
                        <resultCurrentQuantity value="0"/>
                        <resultRemainingQuantity value="0"/>
                    </queryAck>
                </ControlActProcess>
            </REPC_IN990111NL>
            <REPC_IN990111NL xmlns="urn:hl7-org:v3" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <id extension="4" root="2.16.840.1.113883.2.4.6.6.1.1"/>
                <creationTime value="20181127115825"/>
                <versionCode code="NICTIZEd2005-Okt"/>
                <interactionId extension="REPC_IN990111NL" root="2.16.840.1.113883.1.6"/>
                <profileId root="2.16.840.1.113883.2.4.3.11.1" extension="810"/>
                <processingCode code="P"/>
                <processingModeCode code="T"/>
                <acceptAckCode code="NE"/>
                <acknowledgement typeCode="AA">
                    <targetMessage>
                        <id extension="114602" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
                    </targetMessage>
                </acknowledgement>
                <receiver>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id root="2.16.840.1.113883.2.4.6.6" extension="1"/>
                    </device>
                </receiver>
                <sender>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id extension="70000020" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </sender>
                <ControlActProcess moodCode="EVN">
                    <authorOrPerformer typeCode="AUT">
                        <participant>
                            <AssignedDevice>
                                <id extension="70000020" root="2.16.840.1.113883.2.4.6.6"/>
                                <id extension="900017438" root="2.16.528.1.1007.3.2"/>
                                <Organization>
                                    <id extension="00002727" root="2.16.528.1.1007.3.3"/>
                                    <name>Huisarts de Jong ZAB</name>
                                    <addr>
                                        <city>Rotterdam</city>
                                    </addr>
                                </Organization>
                            </AssignedDevice>
                        </participant>
                    </authorOrPerformer>
                    <subject>
                        <organizer classCode="CLUSTER" moodCode="EVN">
                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.16"/>
                            <code code="75310-3" displayName="Health concerns" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"/>
                            <statusCode code="completed"/>
                            <recordTarget typeCode="RCT" contextControlCode="OP">
                                <patientRole>
                                    <id root="2.16.840.1.113883.2.4.6.3" extension="900154858"/>
                                </patientRole>
                            </recordTarget>
                            <component typeCode="COMP" contextControlCode="OP">
                                <act classCode="ACT" moodCode="EVN">
                                    <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.212"/>
                                    <id extension="hc657498ft562.9895" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                    <code code="CONC" codeSystem="2.16.840.1.113883.5.6" displayName="Concern"/>
                                    <text>Diabetes Mellitus type II</text>
                                    <statusCode code="active"/>
                                    <effectiveTime>
                                        <low value="20070402"/>
                                    </effectiveTime>
                                    <entryRelationship typeCode="SUBJ">
                                        <observation classCode="OBS" moodCode="EVN">
                                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.213"/>
                                            <id extension="po3564b7c0-2111" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                            <code code="282291009" codeSystem="2.16.840.1.113883.6.96" displayName="Diagnosis"/>
                                            <statusCode code="completed"/>
                                            <effectiveTime>
                                                <low value="20070402"/>
                                            </effectiveTime>
                                            <value xsi:type="CD" code="T90.02" codeSystem="2.16.840.1.113883.2.4.4.31.1" displayName="Diabetes Mellitus type II" codeSystemName="ICPC-1-NL"/>
                                        </observation>
                                    </entryRelationship>
                                </act>
                            </component>
                        </organizer>
                    </subject>
                    <queryAck>
                        <queryId extension="KZ_29a3bec1-2009-40c1-b137-060a06aab3db" root="2.16.528.1.1007.3.1.1009.1"/>
                        <queryResponseCode code="OK"/>
                        <resultTotalQuantity value="1"/>
                        <resultCurrentQuantity value="1"/>
                        <resultRemainingQuantity value="0"/>
                    </queryAck>
                </ControlActProcess>
            </REPC_IN990111NL>
            <REPC_IN990111NL xmlns="urn:hl7-org:v3" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <id extension="8" root="2.16.840.1.113883.2.4.6.6.1.1"/>
                <creationTime value="20181127115825"/>
                <versionCode code="NICTIZEd2005-Okt"/>
                <interactionId extension="REPC_IN990111NL" root="2.16.840.1.113883.1.6"/>
                <profileId root="2.16.840.1.113883.2.4.3.11.1" extension="810"/>
                <processingCode code="P"/>
                <processingModeCode code="T"/>
                <acceptAckCode code="NE"/>
                <acknowledgement typeCode="AA">
                    <targetMessage>
                        <id extension="114603" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
                    </targetMessage>
                </acknowledgement>
                <receiver>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id root="2.16.840.1.113883.2.4.6.6" extension="1"/>
                    </device>
                </receiver>
                <sender>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id extension="70000021" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </sender>
                <ControlActProcess moodCode="EVN">
                    <authorOrPerformer typeCode="AUT">
                        <participant>
                            <AssignedDevice>
                                <id extension="70000021" root="2.16.840.1.113883.2.4.6.6"/>
                                <id extension="900017438" root="2.16.528.1.1007.3.2"/>
                                <Organization>
                                    <id extension="00003131" root="2.16.528.1.1007.3.3"/>
                                    <name>Huisarts Prins ZAB</name>
                                    <addr>
                                        <city>Rotterdam</city>
                                    </addr>
                                </Organization>
                            </AssignedDevice>
                        </participant>
                    </authorOrPerformer>
                    <subject>
                        <organizer classCode="CLUSTER" moodCode="EVN">
                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.16"/>
                            <code code="75310-3" displayName="Health concerns" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"/>
                            <statusCode code="completed"/>
                            <recordTarget typeCode="RCT" contextControlCode="OP">
                                <patientRole>
                                    <id root="2.16.840.1.113883.2.4.6.3" extension="900154858"/>
                                </patientRole>
                            </recordTarget>
                            <component typeCode="COMP" contextControlCode="OP">
                                <act classCode="ACT" moodCode="EVN">
                                    <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.212"/>
                                    <id extension="hc657498ft562.9895" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                    <code code="CONC" codeSystem="2.16.840.1.113883.5.6" displayName="Concern"/>
                                    <text>Diabetes Mellitus type II</text>
                                    <statusCode code="active"/>
                                    <effectiveTime>
                                        <low value="20070402"/>
                                    </effectiveTime>
                                    <entryRelationship typeCode="SUBJ">
                                        <observation classCode="OBS" moodCode="EVN">
                                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.213"/>
                                            <id extension="po3564b7c0-2111" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                            <code code="282291009" codeSystem="2.16.840.1.113883.6.96" displayName="Diagnosis"/>
                                            <statusCode code="completed"/>
                                            <effectiveTime>
                                                <low value="20070402"/>
                                            </effectiveTime>
                                            <value xsi:type="CD" code="T90.02" codeSystem="2.16.840.1.113883.2.4.4.31.1" displayName="Diabetes Mellitus type II" codeSystemName="ICPC-1-NL"/>
                                        </observation>
                                    </entryRelationship>
                                </act>
                            </component>
                        </organizer>
                    </subject>
                    <queryAck>
                        <queryId extension="KZ_29a3bec1-2009-40c1-b137-060a06aab3db" root="2.16.528.1.1007.3.1.1009.1"/>
                        <queryResponseCode code="OK"/>
                        <resultTotalQuantity value="1"/>
                        <resultCurrentQuantity value="1"/>
                        <resultRemainingQuantity value="0"/>
                    </queryAck>
                </ControlActProcess>
            </REPC_IN990111NL>
        </MCCI_IN200101>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>